# Pandas

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(20200409)

## Series

In [3]:
labels = ['a', 'b', 'c']
mylist = [10, 20, 30]
myarray = np.array([10, 20, 30])
mydict = {'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(data = mylist, index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(data = myarray, index = labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data = mydict)

a    10
b    20
c    30
dtype: int64

In [12]:
myserie = pd.Series([1,2,3,4],index = ['Chile', 'Bolivia','Argentina', 'Brasil'])

In [13]:
myserie['Chile']

1

## DataFrame

In [17]:
df = pd.DataFrame(data = randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [19]:
df

          W         X         Y         Z
A -2.354170 -0.223082  1.123460 -2.695251
B -0.662797 -1.328840 -0.811654  1.636465
C -1.042307  2.282787  0.468138  0.704339
D -0.033946  0.993245 -2.563723  1.029603
E -0.686164  0.014241 -0.719187 -1.035712

In [20]:
df['W']

A   -2.354170
B   -0.662797
C   -1.042307
D   -0.033946
E   -0.686164
Name: W, dtype: float64

In [21]:
df[['W', 'Y']]

          W         Y
A -2.354170  1.123460
B -0.662797 -0.811654
C -1.042307  0.468138
D -0.033946 -2.563723
E -0.686164 -0.719187

In [24]:
df.X

A   -0.223082
B   -1.328840
C    2.282787
D    0.993245
E    0.014241
Name: X, dtype: float64

In [31]:
df['NewCol'] = df['X'] + df['Y']
df

          W         X         Y         Z    NewCol
A -2.354170 -0.223082  1.123460 -2.695251  0.900378
B -0.662797 -1.328840 -0.811654  1.636465 -2.140494
C -1.042307  2.282787  0.468138  0.704339  2.750925
D -0.033946  0.993245 -2.563723  1.029603 -1.570478
E -0.686164  0.014241 -0.719187 -1.035712 -0.704946

In [32]:
df.drop('NewCol', axis = 1, inplace = True)
df

          W         X         Y         Z
A -2.354170 -0.223082  1.123460 -2.695251
B -0.662797 -1.328840 -0.811654  1.636465
C -1.042307  2.282787  0.468138  0.704339
D -0.033946  0.993245 -2.563723  1.029603
E -0.686164  0.014241 -0.719187 -1.035712

In [33]:
df.drop('C', axis = 0, inplace = True)
df

          W         X         Y         Z
A -2.354170 -0.223082  1.123460 -2.695251
B -0.662797 -1.328840 -0.811654  1.636465
D -0.033946  0.993245 -2.563723  1.029603
E -0.686164  0.014241 -0.719187 -1.035712

In [36]:
df.loc['A']

W   -2.354170
X   -0.223082
Y    1.123460
Z   -2.695251
Name: A, dtype: float64

In [38]:
df.iloc[0]

W   -2.354170
X   -0.223082
Y    1.123460
Z   -2.695251
Name: A, dtype: float64

In [39]:
df.loc['A', 'W']

-2.354170083220232

In [40]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -2.354170  1.123460
B -0.662797 -0.811654

In [41]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B  False  False  False   True
D  False   True  False   True
E  False   True  False  False

In [42]:
df[df > 0]

    W         X        Y         Z
A NaN       NaN  1.12346       NaN
B NaN       NaN      NaN  1.636465
D NaN  0.993245      NaN  1.029603
E NaN  0.014241      NaN       NaN

In [46]:
df.reset_index(inplace = True)

In [47]:
df

  index         W         X         Y         Z
0     A -2.354170 -0.223082  1.123460 -2.695251
1     B -0.662797 -1.328840 -0.811654  1.636465
2     D -0.033946  0.993245 -2.563723  1.029603
3     E -0.686164  0.014241 -0.719187 -1.035712

In [49]:
df.set_index('index', inplace = True)

In [51]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = pd.MultiIndex.from_tuples(list(zip(outside,inside)))

In [53]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns = ['A','B'])
df

             A         B
G1 1 -0.224418 -1.195320
   2  0.010920 -2.498004
   3 -0.873533 -0.062110
G2 1  1.633851  1.875256
   2 -0.045723  0.678543
   3 -0.621329 -0.882155

In [54]:
df.loc['G1']

          A         B
1 -0.224418 -1.195320
2  0.010920 -2.498004
3 -0.873533 -0.062110

In [55]:
df.index.names = ['Group','Num']

In [56]:
df

                  A         B
Group Num
G1    1   -0.224418 -1.195320
      2    0.010920 -2.498004
      3   -0.873533 -0.062110
G2    1    1.633851  1.875256
      2   -0.045723  0.678543
      3   -0.621329 -0.882155

In [57]:
df.xs(['G1',1])

A   -0.224418
B   -1.195320
Name: (G1, 1), dtype: float64

In [58]:
df.xs(1, level = 'Num')

              A         B
Group
G1    -0.224418 -1.195320
G2     1.633851  1.875256

## Datos perdidos

In [59]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [60]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [61]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [62]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [63]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [64]:
df.fillna(value = 'MY VALUE')

          A         B  C
0         1         5  1
1         2  MY VALUE  2
2  MY VALUE  MY VALUE  3

In [65]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

In [67]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['John','George','Robert','Sarah','Maisse','Michael'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [68]:
df

  Company   Person  Sales
0    GOOG     John    200
1    GOOG   George    120
2    MSFT   Robert    340
3    MSFT    Sarah    124
4      FB   Maisse    243
5      FB  Michael    350

In [69]:
df.groupby('Company')

In [72]:
df_grouped = df.groupby('Company')

In [73]:
df_grouped.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [74]:
df_grouped.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [76]:
df_grouped.min()

         Person  Sales
Company
FB       Maisse    243
GOOG     George    120
MSFT     Robert    124

In [77]:
df_grouped.max()

          Person  Sales
Company
FB       Michael    350
GOOG        John    200
MSFT       Sarah    340

In [78]:
df_grouped.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [82]:
df_grouped.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000